In [1]:
import pandas as pd
import sqlite3
import os
import pandas as pd
import nbconvert

In [2]:
# Load csv file into pandas dataframe
activity_types_df = pd.read_csv('../data/processed/activity_types.csv')
activities_df = pd.read_csv('../data/processed/activities.csv')
performance_df = pd.read_csv('../data/processed/performance_metrics.csv')
laps_df = pd.read_csv('../data/processed/lap_metrics.csv')
elevation_df = pd.read_csv('../data/processed/elevation_metrics.csv')

In [3]:
# Creating SQLite database
conn = sqlite3.connect('../database/database.sqlite')
cursor = conn.cursor()

In [4]:
# Table Definition
create_table_1 = '''CREATE TABLE IF NOT EXISTS ActivityTypes(
                ActivityTypeID Text PRIMARY KEY,
                ActivityType Text NOT NULL);
                '''

# Creating the table into our database
cursor.execute(create_table_1)

In [5]:
# insert the data from the DataFrame into the SQLite table
activity_types_df.to_sql('ActivityTypes', conn, if_exists='replace', index = False)

# Printing pandas dataframe
pd.read_sql('''SELECT * FROM ActivityTypes''', conn)

  Activity Type ID      Activity Type
0            AT001  Treadmill Running
1            AT002            Running
2            AT003      Indoor Rowing
3            AT004      Pool Swimming
4            AT005             Cardio
5            AT006         Elliptical
6            AT007              Other
7            AT008            Walking
8            AT009     Indoor Cycling
9            AT010            Cycling

In [6]:
# Table Definition
create_table_2 = '''CREATE TABLE IF NOT EXISTS Activities (
                ActivityID Integer PRIMARY KEY, 
                ActivityTypeID Text NOT NULL, 
                Date Datetime, 
                Title Text NOT NULL,
                FOREIGN KEY (ActivityTypeID) REFERENCES ActivityTypes (ActivityTypeID)
                );
                '''

# Creating the table into our database
cursor.execute(create_table_2)

In [7]:
# insert the data from the DataFrame into the SQLite table
activities_df.to_sql('Activities', conn, if_exists='replace', index = False)

# Printing pandas dataframe
pd.read_sql('''SELECT * FROM Activities''', conn)

,Activity ID,Activity Type ID,Date,Title
0,1,AT001,2024-01-22 20:19:55,Treadmill Running
1,2,AT001,2024-01-18 17:02:50,Treadmill Running
2,3,AT001,2024-01-15 19:33:44,Treadmill Running
3,4,AT001,2024-01-12 18:19:25,Base
4,5,AT001,2024-01-09 15:51:13,Base
...,...,...,...,...
408,409,AT002,2020-07-20 17:07:49,Stratford on Avon - Easy Run
409,410,AT002,2020-07-18 06:46:00,Stratford on Avon - Easy Run
410,411,AT002,2020-07-16 21:02:11,Easy Run
411,412,AT002,2020-07-14 18:51:28,Benchmark Run
412,413,AT002,2020-07-11 20:01:36,Benchmark Run

In [8]:
# Table Definition
create_table_3 = '''CREATE TABLE IF NOT EXISTS PerformanceMetrics (
                PerformanceID Text PRIMARY KEY, 
                ActivityID Integer NOT NULL, 
                ActivityTypeID Text NOT NULL, 
                Distance Float NOT NULL, 
                Calories Float NOT NULL, 
                TimeMinutes Float NOT NULL, 
                AvgHR Integer NOT NULL, 
                MaxHR Integer NOT NULL, 
                AerobicTE Float NOT NULL, 
                AvgRunCadence Float NOT NULL, 
                AvgPaceMinKm Float NOT NULL, 
                BestPaceMinKm Float NOT NULL, 
                FOREIGN KEY (ActivityID) REFERENCES Activities (ActivityID), 
                FOREIGN KEY (ActivityTypeID) REFERENCES ActivityTypes (ActivityTypeID)
                );
                '''

# Creating the table into our database
cursor.execute(create_table_3)

In [9]:
# insert the data from the DataFrame into the SQLite table
performance_df.to_sql('PerformanceMetrics', conn, if_exists='replace', index = False)

# Printing pandas dataframe
pd.read_sql('''SELECT * FROM PerformanceMetrics''', conn)

,Performance ID,Activity ID,Activity Type ID,Distance,Calories,Time (minutes),Avg HR,Max HR,Aerobic TE,Avg Run Cadence,Avg Pace (min/km),Best Pace (min/km)
0,1_AT001,1,AT001,5.26,408.0,30.13,147,169,3.5,167.0,5.73,4.38
1,2_AT001,2,AT001,5.12,410.0,30.33,148,171,3.5,167.0,5.92,4.98
2,3_AT001,3,AT001,5.01,403.0,30.20,146,167,3.4,164.0,6.03,3.90
3,4_AT001,4,AT001,4.80,412.0,30.32,148,166,3.4,163.0,6.32,5.08
4,5_AT001,5,AT001,5.15,423.0,31.17,148,164,3.5,163.0,6.05,4.20
...,...,...,...,...,...,...,...,...,...,...,...,...
408,409_AT002,409,AT002,5.96,461.0,36.52,146,169,3.5,149.0,6.13,4.02
409,410_AT002,410,AT002,9.96,821.0,60.08,156,176,5.0,151.0,6.03,4.50
410,411_AT002,411,AT002,5.36,433.0,30.02,157,178,4.2,157.0,5.60,4.37
411,412_AT002,412,AT002,1.60,128.0,9.00,154,179,2.7,142.0,5.63,3.15
412,413_AT002,413,AT002,5.00,391.0,28.17,157,177,4.0,150.0,5.63,3.63

In [10]:
# Table Definition
create_table_4 = '''CREATE TABLE IF NOT EXISTS LapMetrics (
                LapID Text PRIMARY KEY, 
                ActivityID Integer NOT NULL, 
                BestLapTimeMin Float NOT NULL, 
                NumberOfLaps Integer NOT NULL, 
                TotalDistanceKm Float NOT NULL, 
                LapDistanceKm Float NOT NULL, 
                MovingTimeMin Float NOT NULL, 
                ElapsedTimeMin Float NOT NULL, 
                FOREIGN KEY (ActivityID) REFERENCES Activities (ActivityID)
                );
                '''

# Creating the table into our database
cursor.execute(create_table_4)

In [11]:
# insert the data from the DataFrame into the SQLite table
laps_df.to_sql('LapMetrics', conn, if_exists='replace', index = False)

# Printing pandas dataframe
pd.read_sql('''SELECT * FROM LapMetrics''', conn)

,Lap ID,Activity ID,Best Lap Time (min),Number of Laps,Total Distance (km),Lap Distance (km),Moving Time (min),Elapsed Time (min)
0,LAP1,1,1.49,6,5.26,0.876667,30.10,30.13
1,LAP2,2,0.78,6,5.12,0.853333,30.23,30.33
2,LAP3,3,0.04,6,5.01,0.835000,30.02,30.20
3,LAP4,4,5.19,5,4.80,0.960000,29.63,30.32
4,LAP5,5,1.35,6,5.15,0.858333,31.12,31.17
...,...,...,...,...,...,...,...,...
268,LAP270,409,4.72,7,5.96,0.851429,34.82,36.82
269,LAP271,410,0.09,12,9.96,0.830000,59.88,60.08
270,LAP272,411,0.01,7,5.36,0.765714,29.90,30.18
271,LAP273,412,0.58,4,1.60,0.400000,0.14,9.00
272,LAP274,413,0.76,8,5.00,0.625000,28.15,28.50

In [12]:
# Table Definition
create_table_5 = '''CREATE TABLE IF NOT EXISTS ElevationMetrics (
                ElevationMetricID Text PRIMARY KEY, 
                ActivityID Integer NOT NULL, 
                TotalAscent Integer NOT NULL, 
                TotalDescent Integer NOT NULL, 
                MinElevation Integer NOT NULL, 
                MaxElevation Integer NOT NULL, 
                FOREIGN KEY (ActivityID) REFERENCES Activities (ActivityID)
                );
                '''

# Creating the table into our database
cursor.execute(create_table_5)

In [13]:
# insert the data from the DataFrame into the SQLite table
elevation_df.to_sql('ElevationMetrics', conn, if_exists='replace', index = False)

# Printing pandas dataframe
pd.read_sql('''SELECT * FROM ElevationMetrics''', conn)

,Elevation Metric ID,Activity ID,Total Ascent,Total Descent,Min Elevation,Max Elevation
0,EM1,8,183.0,192.0,164.0,311.0
1,EM2,10,8.0,8.0,63.0,73.0
2,EM3,11,1.0,2.0,63.0,67.0
3,EM4,12,55.0,55.0,92.0,155.0
4,EM5,13,77.0,78.0,102.0,175.0
...,...,...,...,...,...,...
221,EM222,409,61.0,61.0,45.0,108.0
222,EM223,410,49.0,48.0,34.0,79.0
223,EM224,411,28.0,14.0,552.0,574.0
224,EM225,412,22.0,17.0,552.0,566.0
225,EM226,413,25.0,26.0,552.0,565.0

In [14]:
# commit the changes and close the connection
conn.commit()

In [15]:
# close the connection
conn.close()

### Convert to .py

In [16]:
#Use nbconvert to export noteboook to transform.py in the etl directory 
!jupyter nbconvert --to script convert_csv_to_sqlite.ipynb --output-dir ../etl --output load

[NbConvertApp] Converting notebook convert_csv_to_sqlite.ipynb to script
[NbConvertApp] Writing 4800 bytes to ../etl/load.py